# Cadence Genus(TM) Synthesis Solution, Version 21.18-s082_1, built Jul 18 2023 13:08:41

# Date: Wed Sep 10 15:11:31 2025
# Host: gmicro02 (x86_64 w/Linux 4.18.0-553.37.1.el8_10.x86_64) (16cores*32cpus*2physical cpus*Intel(R) Xeon(R) Silver 4314 CPU @ 2.40GHz 16384KB)
# OS:   Red Hat Enterprise Linux release 8.10 (Ootpa)

source /home/schultz/Documents/ARQIII_Works/ACTV_04_SquareRoot_SecondVersion/Synthesis/scripts/Square_root.tcl
report_timing
report_area
report_power
